#+SETUPFILE: setup.org
#+TITLE: All Configs in One File

*** general

#+HEADER: :exports both
#+HEADER: :var mystring="Sunday" :var myint=145 :var mydouble=3.14 :exports both
#+HEADER: :includes '(<vector> <numeric> <iostream> <sstream>)
#+HEADER: :flags -std=c++11
#+BEGIN_SRC C++
  inline void build_string(std::ostream& o) {}

  template<class First, class... Rest>
  inline void build_string(std::ostream& o, const First& value, const Rest&... rest) {
      o << value;
      build_string(o, rest...);
  }

  template<class... T>
  std::string concat_string(const T&... value) {
      std::ostringstream o;
      build_string(o, value...);
      return o.str();
  }

  int main(void ) {
      printf ("mystring %s\n", mystring);
      printf ("myint    %d\n", myint);
      printf ("mydouble %g\n", mydouble);

      int a = [](){ return 2; }();
      int b = 5;
      printf("a + b: %d\n", a+b);

      std::vector<int> v( 100 );
      std::iota( std::begin( v ), std::end( v ), 0 );
      std::cout << v[7] << std::endl;

      int year = 2016;
      int month = 2;
      int day = 18;
      std::string date_string = concat_string(year, '-', month, '-', day);
      std::cout << date_string << std::endl;
      return 0;
  }
#+END_SRC

#+RESULTS:
| mystring  | Sunday |    |   |
| myint     |    145 |    |   |
| mydouble  |   3.14 |    |   |
| a         |      + | b: | 7 |
| 7         |        |    |   |
| 2016-2-18 |        |    |   |

besides =C=, =C++=, also supports:

- emacs lisp
- python
- R
- javascript
- etc

- =:cmdline= :: confs for executable
- =:flags= :: compiler
- =:main= :: "no" to prevent default wrapping
- =:includes= :: C && C++ only
- =:defines= :: C & C++ only

**** ruby

  #+header: :exports both
  #+BEGIN_SRC ruby
    require 'date'
    "This file was last evaluated on #{Date.today}"
  #+END_SRC

  #+RESULTS:
  : This file was last evaluated on 2016-02-18

**** shell

#+HEADER: :exports both
#+BEGIN_SRC sh
  echo "This file takes up `du -h configs.org | sed 's/\([0-9k]*\)[ ]*configs.org/\1/'`"
#+END_SRC

#+RESULTS:
: This file takes up 4.0K

**** R

  - install R on linux: =sudo apt-get install r-base r-base-dev=
  - run R repl: =R=
  - install R package: =R CMD INSTALL <package-name>=

  #+BEGIN_SRC R :exports both
  sqrt(42)
  #+END_SRC

   #+BEGIN_SRC R :colnames yes
    words <- tolower(scan("imurfather.org", what="", na.strings=c("|",":")))
    t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
  #+END_SRC

  #+RESULTS:
  | #+begin_src | #+end_src | :exports | #+results: | both | todo | code | message----- | your | 9.05 |
  |-------------+-----------+----------+------------+------+------+------+--------------+------+------|
  |           8 |         8 |        6 |          6 |    5 |    5 |    4 |            4 |    4 |    3 |

